Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # cloudflare_filter.transmission will be updated in-place
~ resource "cloudflare_filter" "transmission" {
      ~ description = "Limit access to Portainer and Transmission to Docker network, server itself, home and office IPs" -> "Limit access to Portainer and Transmission to Docker network, server itself and office IPs"
      ~ expression  = <<~EOT
            (
              http.host in {"portainer.milanvit.net" "transmission.milanvit.net"}
              and not (
          -     ip.src in {172.17.0.0/16 111.98.60.102 148.251.233.134 183.77.3.6 122.218.87.26 122.218.87.66 183.76.15.60}
          +     ip.src in {172.17.0.0/16 111.98.60.102 148.251.233.134 122.218.87.26 122.218.87.66}
                or http.cookie contains "secure-token=K7ZjY6DsctCoUe0GIGJUF4DEKWvwfyWH2z9Iog10sGd7zqJqzWBZhdAqSPJpyOsDUSFQaS6kjAGrQ522GMsvjNbmrNXXQMtSF+DESfw7oR6asZhRev87c10nKeJLC8UtSNcDDOdOXiavUl2PH/ra/sKTWhf6U+pLmv4T6Yevq2oAIFdaDJwOanok0MUigbdCpoGuiOVUBQM+ecElGTVTFP2o042Pv2N1awGdrDpjrQE4Vhvhtcth5yFYInEWsMdngz2B624mCwOrfKx8BDxnf6YvSryg8/UgjMpidtYKff0loALf5+VINYiga6w/iSnAo8z+8FPfcsH7iZK11Fs/jw=="
                or http.request.uri.path contains "/.well-known/acme-challenge/"
              )
            )
        EOT
        id          = "6e4e0860de6a4fa2a7bcccb6e8269747"
        paused      = false
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["atlantis-rion-ml"] will be destroyed
- resource "cloudflare_record" "milanvit_net_cname" {
      - created_on  = "2020-05-03T04:21:06.287065Z" -> null
      - data        = {} -> null
      - hostname    = "atlantis-rion-ml.milanvit.net" -> null
      - id          = "fa8a87df45ac86ddd82615c6192fe48a" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2020-05-03T04:21:06.287065Z" -> null
      - name        = "atlantis-rion-ml" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "milanvit.net" -> null
      - zone_id     = "9f7f8ee361f355357f2463e64a170d0f" -> null
    }

  # cloudflare_record.milanvit_net_cname["auth"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "auth"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.milanvit.net/lock?id=Cellane%252Fmilanvit.net%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
